app/controllers/todo_items_controller.rb

SELECT  "todo_items".* FROM "todo_items" LIMIT 1
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."completed" = ?  [["completed", "t"]]
---
  def index
    @todo_items = TodoItem.all
    @number_of_completed_todos = TodoItem.where(completed: true).count

INSERT INTO "todo_items" ("title", "description", "completed", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Opis"], ["description", "Opis"], ["completed", "t"], ["due_date", "2015-12-10"], ["created_at", "2015-12-03 06:49:17.372492"], ["updated_at", "2015-12-03 06:49:17.372492"]]
---
  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_todo_item
      @todo_item = TodoItem.find(params[:id])